Tekla Open API Reference for Tekla Structures 2025
Dialogs.GetPluginFormBaseByPluginFormName Method
 Retrieves an instance of the form.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static PluginFormBase GetPluginFormBaseByPluginFormName(
	string pluginFormName
)
Public Shared Function GetPluginFormBaseByPluginFormName (
	pluginFormName As String
) As PluginFormBase
Parameters
pluginFormName
Type: System.String
The complete name of the plug-in form (including the plug-in name).
Return Value
Type: PluginFormBase
The existing PluginFormBase or null if it did not exist.
See Also
Reference
Dialogs Class
Tekla.Structures.Dialog Namespace